; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image7 - mode
	infrared1 - mode
	image2 - mode
	spectrograph8 - mode
	thermograph4 - mode
	spectrograph3 - mode
	spectrograph5 - mode
	image6 - mode
	image0 - mode
	Star4 - direction
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image2)
	(supports instrument0 spectrograph8)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 image7)
	(supports instrument2 image6)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument3 image6)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 image2)
	(supports instrument5 thermograph4)
	(supports instrument5 image7)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Star5)
	(have_image Star5 image0)
	(have_image Planet6 spectrograph8)
	(have_image Planet6 spectrograph5)
	(have_image Planet6 image6)
	(have_image Phenomenon7 image2)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon7 spectrograph5)
	(have_image Planet8 image6)
	(have_image Planet8 image0)
	(have_image Planet9 thermograph4)
))

)

; plan
1. (turn_to satellite2 star3 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star3)
   goals met: 0 of 12
2. (turn_to satellite0 star0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star0)
   goals met: 0 of 12
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 12
4. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 12
5. (turn_to satellite0 planet6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet6)
   goals met: 0 of 12
6. (take_image satellite0 planet6 instrument1 spectrograph5)
   added: (have_image planet6 spectrograph5)
   goals met: 1 of 12
7. (turn_to satellite0 phenomenon7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 12
8. (take_image satellite0 phenomenon7 instrument1 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 2 of 12
9. (turn_to satellite0 star3 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star3)
   goals met: 2 of 12
10. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 12
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 12
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
13. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 2 of 12
14. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 2 of 12
15. (turn_to satellite0 phenomenon7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 12
16. (take_image satellite0 phenomenon7 instrument0 image2)
   added: (have_image phenomenon7 image2)
   goals met: 3 of 12
17. (turn_to satellite0 planet6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet6)
   goals met: 3 of 12
18. (take_image satellite0 planet6 instrument0 spectrograph8)
   added: (have_image planet6 spectrograph8)
   goals met: 4 of 12
19. (turn_to satellite1 star0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star0)
   goals met: 5 of 12
20. (turn_to satellite2 planet6 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet6)
   goals met: 5 of 12
21. (take_image satellite2 planet6 instrument3 image6)
   added: (have_image planet6 image6)
   goals met: 6 of 12
22. (turn_to satellite2 planet8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet8)
   goals met: 6 of 12
23. (take_image satellite2 planet8 instrument3 image6)
   added: (have_image planet8 image6)
   goals met: 7 of 12
24. (turn_to satellite2 planet9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet9)
   goals met: 7 of 12
25. (take_image satellite2 planet9 instrument3 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 8 of 12
26. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 8 of 12
27. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 8 of 12
28. (turn_to satellite2 groundstation1 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 groundstation1)
   goals met: 8 of 12
29. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 8 of 12
30. (turn_to satellite2 phenomenon7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon7)
   goals met: 8 of 12
31. (take_image satellite2 phenomenon7 instrument4 image0)
   added: (have_image phenomenon7 image0)
   goals met: 9 of 12
32. (turn_to satellite2 planet8 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet8)
   goals met: 9 of 12
33. (take_image satellite2 planet8 instrument4 image0)
   added: (have_image planet8 image0)
   goals met: 10 of 12
34. (turn_to satellite2 star5 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star5)
   goals met: 11 of 12
35. (take_image satellite2 star5 instrument4 image0)
   added: (have_image star5 image0)
   goals met: 12 of 12
